Revit 2026 API

# ElectricalSystemApparentCurrent Property

---

The ApparentCurrent value of the Electrical System.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double ApparentCurrent { get; }
```
```vb
Public ReadOnly Property ApparentCurrent As Double
	Get
```
```cpp
public:
property double ApparentCurrent {
	double get ();
}
```
```fsharp
member ApparentCurrent : float with get
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This property only available when System Type is Power! |

This property is used to retrieve the ApparentCurrent value of the Electrical System.

#### Reference

ElectricalSystem Class

Autodesk.Revit.DB.Electrical Namespace